import React from 'react';
import styled from "styled-components";

const Younger = () => {
    return (
        <div>
            <YoungerWrapper>
                <div className="container">
                    <div className="wrapper mini-container">
                        <h1 className="top-header">18+</h1>
                        <p className="top-text">ДИҚҚАТ!</p>
                        <p className="md-text">Ўзбекистон Республикасининг “Болаларни уларнинг соғлиғига зарар етказувчи ахборотдан ҳимоя қилиш тўғрисида” 08.09.2017 йилдаги қонунига мувофиқ:

                            болаларни уларнинг ҳаётига ва (ёки) соғлиғига хавф соладиган хатти-ҳаракатларни содир этишга, шу жумладан ўз соғлиғига зарар етказишга, ўз жонига қасд қилишга ва шундай ҳаракатларни тарғиб қилишга ундайдиган;

                            болаларда алкоголли ва тамаки маҳсулотларини, гиёҳвандлик воситаларини, психотроп моддаларни ёки ақл-ирода фаолиятига таъсир этувчи бошқа моддаларни истеъмол қилиш, қимор ўйинларида, оммавий тартибсизликларда иштирок этиш, фоҳишалик, дарбадарлик, тиланчилик ёки ғайриижтимоий хатти-ҳаракатнинг бошқа шакллари билан шуғулланиш истагини пайдо қиладиган;

                            одамларга ёки ҳайвонларга нисбатан зўравонлик ва шафқатсизлик қилиш мумкинлигини асослайдиган ёки оқлайдиган ёхуд зўравонлик хатти-ҳаракатларини амалга оширишга ундайдиган;

                            оилавий қадриятларни инкор этадиган, ахлоқсизликни тарғиб қиладиган, шунингдек ота-онасига ва оиланинг бошқа аъзоларига нисбатан ҳурматсиз муносабатни шакллантирадиган;

                            ғайриқонуний хулқ-атворни оқлайдиган ва ҳуқуқбузарлик содир этишга олиб келадиган;

                            жамиятда бузғунчилик ғояларини тарғиб этишга чақирадиган;

                            уятли сўзларни ўз ичига олган;

                            порнография хусусиятига эга бўлган ахборотни ўз ичига олган;

                            ғайриқонуний ҳаракатлар натижасида жабрланган болалар тўғрисидаги, шу жумладан бундай боланинг фамилияси, исми, отасининг исми, унинг ота-онаси ва бошқа қонуний вакилларининг фото- ва видеотасвирлари, бундай боланинг туғилган санаси, унинг овози ёзилган аудиотасма, яшаш жойи ёки вақтинча турган жойи, ўқиш ёки иш жойи тўғрисидаги, бундай боланинг шахсини бевосита ёхуд билвосита аниқлашга имкон берадиган бошқа ахборотни ўз ичига олган ахборот маҳсулоти болалар ўртасида тарқатилиши тақиқланган ахборот маҳсулотлари жумласига киради.

                            Шунга кўра, Kun.uz сайтида эълон қилинаётган айрим ахборот (хабар, маълумот, мақола)лар болалар учун тақиқланган ахборот маҳсулоти ҳисобланади ва 18 ёшга тўлмаган шахслар ундан фойдаланиши тақиқланади.</p>
                    </div>
                </div>
            </YoungerWrapper>
        </div>
    );
};

const YoungerWrapper = styled.div `

.container {
  max-width: 1336px;
  margin: 0 auto;
  
  .mini-container {
    max-width: 1000px;
    margin: 0 auto;

    .top-header {
      font-family: 'Montserrat';
      font-style: normal;
      font-weight: bold;
      font-size: 20px;
      color: #0C2F75;
      text-align: center;
      margin-top: 66px;
    }
    
    
    .top-text {
      font-family: 'Montserrat';
      font-style: normal;
      font-weight: bold;
      font-size: 20px;
      color: #000000;
      margin-top: 20px;
    }
    
    .md-text {
      font-family: 'Montserrat';
      font-style: normal;
      font-weight: 600;
      font-size: 14px;
      color: #000000;
      margin-top: 30px;
      line-height: 26px;
    }
  } 
}

`

export default Younger;